SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rxf.h
/** @} End of group EFR32FG25_RXF */

/**************************************************************************//**
 * @addtogroup EFR32FG25_RXF
 * @{
 * @defgroup EFR32FG25_RXF_BitFields RXF Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for RXF IPVERSION */
#define _RXF_IPVERSION_RESETVALUE           0x00000001UL                                /**< Default value for RXF_IPVERSION             */
#define _RXF_IPVERSION_MASK                 0xFFFFFFFFUL                                /**< Mask for RXF_IPVERSION                      */
#define _RXF_IPVERSION_IPVERSION_SHIFT      0                                           /**< Shift value for RXF_IPVERSION               */
#define _RXF_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                                /**< Bit mask for RXF_IPVERSION                  */
#define _RXF_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                                /**< Mode DEFAULT for RXF_IPVERSION              */
#define RXF_IPVERSION_IPVERSION_DEFAULT     (_RXF_IPVERSION_IPVERSION_DEFAULT << 0)     /**< Shifted mode DEFAULT for RXF_IPVERSION      */

/* Bit fields for RXF EN */
#define _RXF_EN_RESETVALUE                  0x00000000UL                                /**< Default value for RXF_EN                    */
#define _RXF_EN_MASK                        0x00000003UL                                /**< Mask for RXF_EN                             */
#define RXF_EN_EN                           (0x1UL << 0)                                /**< Module Enable                               */
#define _RXF_EN_EN_SHIFT                    0                                           /**< Shift value for RXF_EN                      */
#define _RXF_EN_EN_MASK                     0x1UL                                       /**< Bit mask for RXF_EN                         */
#define _RXF_EN_EN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for RXF_EN                     */
#define RXF_EN_EN_DEFAULT                   (_RXF_EN_EN_DEFAULT << 0)                   /**< Shifted mode DEFAULT for RXF_EN             */
#define RXF_EN_DISABLING                    (0x1UL << 1)                                /**< Disablement Busy Status                     */
#define _RXF_EN_DISABLING_SHIFT             1                                           /**< Shift value for RXF_DISABLING               */
#define _RXF_EN_DISABLING_MASK              0x2UL                                       /**< Bit mask for RXF_DISABLING                  */
#define _RXF_EN_DISABLING_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for RXF_EN                     */
#define RXF_EN_DISABLING_DEFAULT            (_RXF_EN_DISABLING_DEFAULT << 1)            /**< Shifted mode DEFAULT for RXF_EN             */

/* Bit fields for RXF SWRST */
#define _RXF_SWRST_RESETVALUE               0x00000000UL                                /**< Default value for RXF_SWRST                 */
#define _RXF_SWRST_MASK                     0x00000003UL                                /**< Mask for RXF_SWRST                          */
#define RXF_SWRST_SWRST                     (0x1UL << 0)                                /**< Software Reset Command                      */
#define _RXF_SWRST_SWRST_SHIFT              0                                           /**< Shift value for RXF_SWRST                   */
#define _RXF_SWRST_SWRST_MASK               0x1UL                                       /**< Bit mask for RXF_SWRST                      */
#define _RXF_SWRST_SWRST_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_SWRST                  */
#define RXF_SWRST_SWRST_DEFAULT             (_RXF_SWRST_SWRST_DEFAULT << 0)             /**< Shifted mode DEFAULT for RXF_SWRST          */
#define RXF_SWRST_RESETTING                 (0x1UL << 1)                                /**< Software Reset Busy Status                  */
#define _RXF_SWRST_RESETTING_SHIFT          1                                           /**< Shift value for RXF_RESETTING               */
#define _RXF_SWRST_RESETTING_MASK           0x2UL                                       /**< Bit mask for RXF_RESETTING                  */
#define _RXF_SWRST_RESETTING_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for RXF_SWRST                  */
#define RXF_SWRST_RESETTING_DEFAULT         (_RXF_SWRST_RESETTING_DEFAULT << 1)         /**< Shifted mode DEFAULT for RXF_SWRST          */

/* Bit fields for RXF CONNECT */
#define _RXF_CONNECT_RESETVALUE             0x00000000UL                                /**< Default value for RXF_CONNECT               */
#define _RXF_CONNECT_MASK                   0x00000100UL                                /**< Mask for RXF_CONNECT                        */
#define RXF_CONNECT_OUT                     (0x1UL << 8)                                /**< Output FIFO connect                         */
#define _RXF_CONNECT_OUT_SHIFT              8                                           /**< Shift value for RXF_OUT                     */
#define _RXF_CONNECT_OUT_MASK               0x100UL                                     /**< Bit mask for RXF_OUT                        */
#define _RXF_CONNECT_OUT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_CONNECT                */
#define RXF_CONNECT_OUT_DEFAULT             (_RXF_CONNECT_OUT_DEFAULT << 8)             /**< Shifted mode DEFAULT for RXF_CONNECT        */

/* Bit fields for RXF DISCLK */
#define _RXF_DISCLK_RESETVALUE              0x00000000UL                                /**< Default value for RXF_DISCLK                */
#define _RXF_DISCLK_MASK                    0x00000001UL                                /**< Mask for RXF_DISCLK                         */
#define RXF_DISCLK_DISCLK                   (0x1UL << 0)                                /**< New BitField                                */
#define _RXF_DISCLK_DISCLK_SHIFT            0                                           /**< Shift value for RXF_DISCLK                  */
#define _RXF_DISCLK_DISCLK_MASK             0x1UL                                       /**< Bit mask for RXF_DISCLK                     */
#define _RXF_DISCLK_DISCLK_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_DISCLK                 */
#define RXF_DISCLK_DISCLK_DEFAULT           (_RXF_DISCLK_DISCLK_DEFAULT << 0)           /**< Shifted mode DEFAULT for RXF_DISCLK         */

/* Bit fields for RXF FIFOOUT */
#define _RXF_FIFOOUT_RESETVALUE             0x00000000UL                                /**< Default value for RXF_FIFOOUT               */
#define _RXF_FIFOOUT_MASK                   0x1FFF0000UL                                /**< Mask for RXF_FIFOOUT                        */
#define _RXF_FIFOOUT_CNT_SHIFT              16                                          /**< Shift value for RXF_CNT                     */
#define _RXF_FIFOOUT_CNT_MASK               0xFF0000UL                                  /**< Bit mask for RXF_CNT                        */
#define _RXF_FIFOOUT_CNT_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_FIFOOUT                */
#define RXF_FIFOOUT_CNT_DEFAULT             (_RXF_FIFOOUT_CNT_DEFAULT << 16)            /**< Shifted mode DEFAULT for RXF_FIFOOUT        */
#define _RXF_FIFOOUT_ALARM_SHIFT            24                                          /**< Shift value for RXF_ALARM                   */
#define _RXF_FIFOOUT_ALARM_MASK             0x1F000000UL                                /**< Bit mask for RXF_ALARM                      */
#define _RXF_FIFOOUT_ALARM_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_FIFOOUT                */
#define RXF_FIFOOUT_ALARM_DEFAULT           (_RXF_FIFOOUT_ALARM_DEFAULT << 24)          /**< Shifted mode DEFAULT for RXF_FIFOOUT        */

/* Bit fields for RXF CTRL */
#define _RXF_CTRL_RESETVALUE                0x00000000UL                                /**< Default value for RXF_CTRL                  */
#define _RXF_CTRL_MASK                      0x0003FF07UL                                /**< Mask for RXF_CTRL                           */
#define RXF_CTRL_CONNECTFE                  (0x1UL << 0)                                /**< New BitField                                */
#define _RXF_CTRL_CONNECTFE_SHIFT           0                                           /**< Shift value for RXF_CONNECTFE               */
#define _RXF_CTRL_CONNECTFE_MASK            0x1UL                                       /**< Bit mask for RXF_CONNECTFE                  */
#define _RXF_CTRL_CONNECTFE_DEFAULT         0x00000000UL                                /**< Mode DEFAULT for RXF_CTRL                   */
#define RXF_CTRL_CONNECTFE_DEFAULT          (_RXF_CTRL_CONNECTFE_DEFAULT << 0)          /**< Shifted mode DEFAULT for RXF_CTRL           */
#define RXF_CTRL_DATEREINIT                 (0x1UL << 1)                                /**< New BitField                                */
#define _RXF_CTRL_DATEREINIT_SHIFT          1                                           /**< Shift value for RXF_DATEREINIT              */
#define _RXF_CTRL_DATEREINIT_MASK           0x2UL                                       /**< Bit mask for RXF_DATEREINIT                 */
#define _RXF_CTRL_DATEREINIT_DEFAULT        0x00000000UL                                /**< Mode DEFAULT for RXF_CTRL                   */
#define RXF_CTRL_DATEREINIT_DEFAULT         (_RXF_CTRL_DATEREINIT_DEFAULT << 1)         /**< Shifted mode DEFAULT for RXF_CTRL           */
#define RXF_CTRL_DATEFORCECNT               (0x1UL << 2)                                /**< New BitField                                */
#define _RXF_CTRL_DATEFORCECNT_SHIFT        2                                           /**< Shift value for RXF_DATEFORCECNT            */
#define _RXF_CTRL_DATEFORCECNT_MASK         0x4UL                                       /**< Bit mask for RXF_DATEFORCECNT               */
#define _RXF_CTRL_DATEFORCECNT_DEFAULT      0x00000000UL                                /**< Mode DEFAULT for RXF_CTRL                   */
#define RXF_CTRL_DATEFORCECNT_DEFAULT       (_RXF_CTRL_DATEFORCECNT_DEFAULT << 2)       /**< Shifted mode DEFAULT for RXF_CTRL           */
#define _RXF_CTRL_DATESKIP_SHIFT            8                                           /**< Shift value for RXF_DATESKIP                */
#define _RXF_CTRL_DATESKIP_MASK             0x3FF00UL                                   /**< Bit mask for RXF_DATESKIP                   */
#define _RXF_CTRL_DATESKIP_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_CTRL                   */
#define RXF_CTRL_DATESKIP_DEFAULT           (_RXF_CTRL_DATESKIP_DEFAULT << 8)           /**< Shifted mode DEFAULT for RXF_CTRL           */

/* Bit fields for RXF DATE */
#define _RXF_DATE_RESETVALUE                0x00000002UL                                /**< Default value for RXF_DATE                  */
#define _RXF_DATE_MASK                      0xFFFFFFFFUL                                /**< Mask for RXF_DATE                           */
#define _RXF_DATE_DATE_SHIFT                0                                           /**< Shift value for RXF_DATE                    */
#define _RXF_DATE_DATE_MASK                 0xFFFFFFFFUL                                /**< Bit mask for RXF_DATE                       */
#define _RXF_DATE_DATE_DEFAULT              0x00000002UL                                /**< Mode DEFAULT for RXF_DATE                   */
#define RXF_DATE_DATE_DEFAULT               (_RXF_DATE_DATE_DEFAULT << 0)               /**< Shifted mode DEFAULT for RXF_DATE           */

