SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rxf.h
/* Bit fields for RXF IF */
#define _RXF_IF_RESETVALUE                  0x00000000UL                                /**< Default value for RXF_IF                    */
#define _RXF_IF_MASK                        0x000003FFUL                                /**< Mask for RXF_IF                             */
#define RXF_IF_RXFIF0                       (0x1UL << 0)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF0_SHIFT                0                                           /**< Shift value for RXF_RXFIF0                  */
#define _RXF_IF_RXFIF0_MASK                 0x1UL                                       /**< Bit mask for RXF_RXFIF0                     */
#define _RXF_IF_RXFIF0_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF0_DEFAULT               (_RXF_IF_RXFIF0_DEFAULT << 0)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF1                       (0x1UL << 1)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF1_SHIFT                1                                           /**< Shift value for RXF_RXFIF1                  */
#define _RXF_IF_RXFIF1_MASK                 0x2UL                                       /**< Bit mask for RXF_RXFIF1                     */
#define _RXF_IF_RXFIF1_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF1_DEFAULT               (_RXF_IF_RXFIF1_DEFAULT << 1)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF2                       (0x1UL << 2)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF2_SHIFT                2                                           /**< Shift value for RXF_RXFIF2                  */
#define _RXF_IF_RXFIF2_MASK                 0x4UL                                       /**< Bit mask for RXF_RXFIF2                     */
#define _RXF_IF_RXFIF2_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF2_DEFAULT               (_RXF_IF_RXFIF2_DEFAULT << 2)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF3                       (0x1UL << 3)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF3_SHIFT                3                                           /**< Shift value for RXF_RXFIF3                  */
#define _RXF_IF_RXFIF3_MASK                 0x8UL                                       /**< Bit mask for RXF_RXFIF3                     */
#define _RXF_IF_RXFIF3_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF3_DEFAULT               (_RXF_IF_RXFIF3_DEFAULT << 3)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF4                       (0x1UL << 4)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF4_SHIFT                4                                           /**< Shift value for RXF_RXFIF4                  */
#define _RXF_IF_RXFIF4_MASK                 0x10UL                                      /**< Bit mask for RXF_RXFIF4                     */
#define _RXF_IF_RXFIF4_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF4_DEFAULT               (_RXF_IF_RXFIF4_DEFAULT << 4)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF5                       (0x1UL << 5)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF5_SHIFT                5                                           /**< Shift value for RXF_RXFIF5                  */
#define _RXF_IF_RXFIF5_MASK                 0x20UL                                      /**< Bit mask for RXF_RXFIF5                     */
#define _RXF_IF_RXFIF5_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF5_DEFAULT               (_RXF_IF_RXFIF5_DEFAULT << 5)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF6                       (0x1UL << 6)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF6_SHIFT                6                                           /**< Shift value for RXF_RXFIF6                  */
#define _RXF_IF_RXFIF6_MASK                 0x40UL                                      /**< Bit mask for RXF_RXFIF6                     */
#define _RXF_IF_RXFIF6_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF6_DEFAULT               (_RXF_IF_RXFIF6_DEFAULT << 6)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF7                       (0x1UL << 7)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF7_SHIFT                7                                           /**< Shift value for RXF_RXFIF7                  */
#define _RXF_IF_RXFIF7_MASK                 0x80UL                                      /**< Bit mask for RXF_RXFIF7                     */
#define _RXF_IF_RXFIF7_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF7_DEFAULT               (_RXF_IF_RXFIF7_DEFAULT << 7)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF8                       (0x1UL << 8)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF8_SHIFT                8                                           /**< Shift value for RXF_RXFIF8                  */
#define _RXF_IF_RXFIF8_MASK                 0x100UL                                     /**< Bit mask for RXF_RXFIF8                     */
#define _RXF_IF_RXFIF8_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF8_DEFAULT               (_RXF_IF_RXFIF8_DEFAULT << 8)               /**< Shifted mode DEFAULT for RXF_IF             */
#define RXF_IF_RXFIF9                       (0x1UL << 9)                                /**< RXF Interrupt Flag                          */
#define _RXF_IF_RXFIF9_SHIFT                9                                           /**< Shift value for RXF_RXFIF9                  */
#define _RXF_IF_RXFIF9_MASK                 0x200UL                                     /**< Bit mask for RXF_RXFIF9                     */
#define _RXF_IF_RXFIF9_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for RXF_IF                     */
#define RXF_IF_RXFIF9_DEFAULT               (_RXF_IF_RXFIF9_DEFAULT << 9)               /**< Shifted mode DEFAULT for RXF_IF             */

/* Bit fields for RXF IEN */
#define _RXF_IEN_RESETVALUE                 0x00000000UL                                /**< Default value for RXF_IEN                   */
#define _RXF_IEN_MASK                       0x000003FFUL                                /**< Mask for RXF_IEN                            */
#define RXF_IEN_RXFIEN0                     (0x1UL << 0)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN0_SHIFT              0                                           /**< Shift value for RXF_RXFIEN0                 */
#define _RXF_IEN_RXFIEN0_MASK               0x1UL                                       /**< Bit mask for RXF_RXFIEN0                    */
#define _RXF_IEN_RXFIEN0_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN0_DEFAULT             (_RXF_IEN_RXFIEN0_DEFAULT << 0)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN1                     (0x1UL << 1)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN1_SHIFT              1                                           /**< Shift value for RXF_RXFIEN1                 */
#define _RXF_IEN_RXFIEN1_MASK               0x2UL                                       /**< Bit mask for RXF_RXFIEN1                    */
#define _RXF_IEN_RXFIEN1_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN1_DEFAULT             (_RXF_IEN_RXFIEN1_DEFAULT << 1)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN2                     (0x1UL << 2)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN2_SHIFT              2                                           /**< Shift value for RXF_RXFIEN2                 */
#define _RXF_IEN_RXFIEN2_MASK               0x4UL                                       /**< Bit mask for RXF_RXFIEN2                    */
#define _RXF_IEN_RXFIEN2_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN2_DEFAULT             (_RXF_IEN_RXFIEN2_DEFAULT << 2)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN3                     (0x1UL << 3)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN3_SHIFT              3                                           /**< Shift value for RXF_RXFIEN3                 */
#define _RXF_IEN_RXFIEN3_MASK               0x8UL                                       /**< Bit mask for RXF_RXFIEN3                    */
#define _RXF_IEN_RXFIEN3_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN3_DEFAULT             (_RXF_IEN_RXFIEN3_DEFAULT << 3)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN4                     (0x1UL << 4)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN4_SHIFT              4                                           /**< Shift value for RXF_RXFIEN4                 */
#define _RXF_IEN_RXFIEN4_MASK               0x10UL                                      /**< Bit mask for RXF_RXFIEN4                    */
#define _RXF_IEN_RXFIEN4_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN4_DEFAULT             (_RXF_IEN_RXFIEN4_DEFAULT << 4)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN5                     (0x1UL << 5)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN5_SHIFT              5                                           /**< Shift value for RXF_RXFIEN5                 */
#define _RXF_IEN_RXFIEN5_MASK               0x20UL                                      /**< Bit mask for RXF_RXFIEN5                    */
#define _RXF_IEN_RXFIEN5_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN5_DEFAULT             (_RXF_IEN_RXFIEN5_DEFAULT << 5)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN6                     (0x1UL << 6)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN6_SHIFT              6                                           /**< Shift value for RXF_RXFIEN6                 */
#define _RXF_IEN_RXFIEN6_MASK               0x40UL                                      /**< Bit mask for RXF_RXFIEN6                    */
#define _RXF_IEN_RXFIEN6_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN6_DEFAULT             (_RXF_IEN_RXFIEN6_DEFAULT << 6)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN7                     (0x1UL << 7)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN7_SHIFT              7                                           /**< Shift value for RXF_RXFIEN7                 */
#define _RXF_IEN_RXFIEN7_MASK               0x80UL                                      /**< Bit mask for RXF_RXFIEN7                    */
#define _RXF_IEN_RXFIEN7_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN7_DEFAULT             (_RXF_IEN_RXFIEN7_DEFAULT << 7)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN8                     (0x1UL << 8)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN8_SHIFT              8                                           /**< Shift value for RXF_RXFIEN8                 */
#define _RXF_IEN_RXFIEN8_MASK               0x100UL                                     /**< Bit mask for RXF_RXFIEN8                    */
#define _RXF_IEN_RXFIEN8_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN8_DEFAULT             (_RXF_IEN_RXFIEN8_DEFAULT << 8)             /**< Shifted mode DEFAULT for RXF_IEN            */
#define RXF_IEN_RXFIEN9                     (0x1UL << 9)                                /**< RXF Interrupt Enable                        */
#define _RXF_IEN_RXFIEN9_SHIFT              9                                           /**< Shift value for RXF_RXFIEN9                 */
#define _RXF_IEN_RXFIEN9_MASK               0x200UL                                     /**< Bit mask for RXF_RXFIEN9                    */
#define _RXF_IEN_RXFIEN9_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_IEN                    */
#define RXF_IEN_RXFIEN9_DEFAULT             (_RXF_IEN_RXFIEN9_DEFAULT << 9)             /**< Shifted mode DEFAULT for RXF_IEN            */

