SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rxf.h
/* Bit fields for RXF ITCTRL */
#define _RXF_ITCTRL_RESETVALUE              0x00000000UL                                /**< Default value for RXF_ITCTRL                */
#define _RXF_ITCTRL_MASK                    0x0000000FUL                                /**< Mask for RXF_ITCTRL                         */
#define RXF_ITCTRL_ITMODE                   (0x1UL << 0)                                /**< New BitField                                */
#define _RXF_ITCTRL_ITMODE_SHIFT            0                                           /**< Shift value for RXF_ITMODE                  */
#define _RXF_ITCTRL_ITMODE_MASK             0x1UL                                       /**< Bit mask for RXF_ITMODE                     */
#define _RXF_ITCTRL_ITMODE_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_ITCTRL                 */
#define _RXF_ITCTRL_ITMODE_reg              0x00000000UL                                /**< Mode reg for RXF_ITCTRL                     */
#define _RXF_ITCTRL_ITMODE_timer            0x00000001UL                                /**< Mode timer for RXF_ITCTRL                   */
#define RXF_ITCTRL_ITMODE_DEFAULT           (_RXF_ITCTRL_ITMODE_DEFAULT << 0)           /**< Shifted mode DEFAULT for RXF_ITCTRL         */
#define RXF_ITCTRL_ITMODE_reg               (_RXF_ITCTRL_ITMODE_reg << 0)               /**< Shifted mode reg for RXF_ITCTRL             */
#define RXF_ITCTRL_ITMODE_timer             (_RXF_ITCTRL_ITMODE_timer << 0)             /**< Shifted mode timer for RXF_ITCTRL           */
#define RXF_ITCTRL_ITTIMERMODE              (0x1UL << 1)                                /**< New BitField                                */
#define _RXF_ITCTRL_ITTIMERMODE_SHIFT       1                                           /**< Shift value for RXF_ITTIMERMODE             */
#define _RXF_ITCTRL_ITTIMERMODE_MASK        0x2UL                                       /**< Bit mask for RXF_ITTIMERMODE                */
#define _RXF_ITCTRL_ITTIMERMODE_DEFAULT     0x00000000UL                                /**< Mode DEFAULT for RXF_ITCTRL                 */
#define _RXF_ITCTRL_ITTIMERMODE_expired     0x00000000UL                                /**< Mode expired for RXF_ITCTRL                 */
#define _RXF_ITCTRL_ITTIMERMODE_equal       0x00000001UL                                /**< Mode equal for RXF_ITCTRL                   */
#define RXF_ITCTRL_ITTIMERMODE_DEFAULT      (_RXF_ITCTRL_ITTIMERMODE_DEFAULT << 1)      /**< Shifted mode DEFAULT for RXF_ITCTRL         */
#define RXF_ITCTRL_ITTIMERMODE_expired      (_RXF_ITCTRL_ITTIMERMODE_expired << 1)      /**< Shifted mode expired for RXF_ITCTRL         */
#define RXF_ITCTRL_ITTIMERMODE_equal        (_RXF_ITCTRL_ITTIMERMODE_equal << 1)        /**< Shifted mode equal for RXF_ITCTRL           */
#define RXF_ITCTRL_ITREG                    (0x1UL << 2)                                /**< New BitField                                */
#define _RXF_ITCTRL_ITREG_SHIFT             2                                           /**< Shift value for RXF_ITREG                   */
#define _RXF_ITCTRL_ITREG_MASK              0x4UL                                       /**< Bit mask for RXF_ITREG                      */
#define _RXF_ITCTRL_ITREG_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for RXF_ITCTRL                 */
#define RXF_ITCTRL_ITREG_DEFAULT            (_RXF_ITCTRL_ITREG_DEFAULT << 2)            /**< Shifted mode DEFAULT for RXF_ITCTRL         */
#define RXF_ITCTRL_ITTRIG                   (0x1UL << 3)                                /**< New BitField                                */
#define _RXF_ITCTRL_ITTRIG_SHIFT            3                                           /**< Shift value for RXF_ITTRIG                  */
#define _RXF_ITCTRL_ITTRIG_MASK             0x8UL                                       /**< Bit mask for RXF_ITTRIG                     */
#define _RXF_ITCTRL_ITTRIG_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_ITCTRL                 */
#define _RXF_ITCTRL_ITTRIG_pulse            0x00000000UL                                /**< Mode pulse for RXF_ITCTRL                   */
#define _RXF_ITCTRL_ITTRIG_level            0x00000001UL                                /**< Mode level for RXF_ITCTRL                   */
#define RXF_ITCTRL_ITTRIG_DEFAULT           (_RXF_ITCTRL_ITTRIG_DEFAULT << 3)           /**< Shifted mode DEFAULT for RXF_ITCTRL         */
#define RXF_ITCTRL_ITTRIG_pulse             (_RXF_ITCTRL_ITTRIG_pulse << 3)             /**< Shifted mode pulse for RXF_ITCTRL           */
#define RXF_ITCTRL_ITTRIG_level             (_RXF_ITCTRL_ITTRIG_level << 3)             /**< Shifted mode level for RXF_ITCTRL           */

/* Bit fields for RXF DATEIT */
#define _RXF_DATEIT_RESETVALUE              0x00000000UL                                /**< Default value for RXF_DATEIT                */
#define _RXF_DATEIT_MASK                    0xFFFFFFFFUL                                /**< Mask for RXF_DATEIT                         */
#define _RXF_DATEIT_DATEIT_SHIFT            0                                           /**< Shift value for RXF_DATEIT                  */
#define _RXF_DATEIT_DATEIT_MASK             0xFFFFFFFFUL                                /**< Bit mask for RXF_DATEIT                     */
#define _RXF_DATEIT_DATEIT_DEFAULT          0x00000000UL                                /**< Mode DEFAULT for RXF_DATEIT                 */
#define RXF_DATEIT_DATEIT_DEFAULT           (_RXF_DATEIT_DATEIT_DEFAULT << 0)           /**< Shifted mode DEFAULT for RXF_DATEIT         */

/* Bit fields for RXF ITSIG */
#define _RXF_ITSIG_RESETVALUE               0x00000000UL                                /**< Default value for RXF_ITSIG                 */
#define _RXF_ITSIG_MASK                     0x00000001UL                                /**< Mask for RXF_ITSIG                          */
#define RXF_ITSIG_ITSIG                     (0x1UL << 0)                                /**< New BitField                                */
#define _RXF_ITSIG_ITSIG_SHIFT              0                                           /**< Shift value for RXF_ITSIG                   */
#define _RXF_ITSIG_ITSIG_MASK               0x1UL                                       /**< Bit mask for RXF_ITSIG                      */
#define _RXF_ITSIG_ITSIG_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_ITSIG                  */
#define RXF_ITSIG_ITSIG_DEFAULT             (_RXF_ITSIG_ITSIG_DEFAULT << 0)             /**< Shifted mode DEFAULT for RXF_ITSIG          */

/* Bit fields for RXF EVCTRL */
#define _RXF_EVCTRL_RESETVALUE              0x00000000UL                                /**< Default value for RXF_EVCTRL                */
#define _RXF_EVCTRL_MASK                    0x00000003UL                                /**< Mask for RXF_EVCTRL                         */
#define _RXF_EVCTRL_TRIG_SHIFT              0                                           /**< Shift value for RXF_TRIG                    */
#define _RXF_EVCTRL_TRIG_MASK               0x3UL                                       /**< Bit mask for RXF_TRIG                       */
#define _RXF_EVCTRL_TRIG_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_EVCTRL                 */
#define _RXF_EVCTRL_TRIG_IDLE               0x00000000UL                                /**< Mode IDLE for RXF_EVCTRL                    */
#define _RXF_EVCTRL_TRIG_RISING             0x00000001UL                                /**< Mode RISING for RXF_EVCTRL                  */
#define _RXF_EVCTRL_TRIG_FALLING            0x00000002UL                                /**< Mode FALLING for RXF_EVCTRL                 */
#define _RXF_EVCTRL_TRIG_BOTH               0x00000003UL                                /**< Mode BOTH for RXF_EVCTRL                    */
#define RXF_EVCTRL_TRIG_DEFAULT             (_RXF_EVCTRL_TRIG_DEFAULT << 0)             /**< Shifted mode DEFAULT for RXF_EVCTRL         */
#define RXF_EVCTRL_TRIG_IDLE                (_RXF_EVCTRL_TRIG_IDLE << 0)                /**< Shifted mode IDLE for RXF_EVCTRL            */
#define RXF_EVCTRL_TRIG_RISING              (_RXF_EVCTRL_TRIG_RISING << 0)              /**< Shifted mode RISING for RXF_EVCTRL          */
#define RXF_EVCTRL_TRIG_FALLING             (_RXF_EVCTRL_TRIG_FALLING << 0)             /**< Shifted mode FALLING for RXF_EVCTRL         */
#define RXF_EVCTRL_TRIG_BOTH                (_RXF_EVCTRL_TRIG_BOTH << 0)                /**< Shifted mode BOTH for RXF_EVCTRL            */

/* Bit fields for RXF EVDATE */
#define _RXF_EVDATE_RESETVALUE              0x00000000UL                                /**< Default value for RXF_EVDATE                */
#define _RXF_EVDATE_MASK                    0xFFFFFFFFUL                                /**< Mask for RXF_EVDATE                         */
#define _RXF_EVDATE_DATE_SHIFT              0                                           /**< Shift value for RXF_DATE                    */
#define _RXF_EVDATE_DATE_MASK               0xFFFFFFFFUL                                /**< Bit mask for RXF_DATE                       */
#define _RXF_EVDATE_DATE_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for RXF_EVDATE                 */
#define RXF_EVDATE_DATE_DEFAULT             (_RXF_EVDATE_DATE_DEFAULT << 0)             /**< Shifted mode DEFAULT for RXF_EVDATE         */

/** @} End of group EFR32FG25_RXF_BitFields */
/** @} End of group EFR32FG25_RXF */
/** @} End of group Parts */

#endif /* EFR32FG25_RXF_H */
